#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Получает массив узлов обмена, используемых в настройках обмена.
//
Функция ПолучитьИспользуемыеУзлыПланаОбмена() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МобильноеПриложение.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
		|ГДЕ
		|	НЕ МобильноеПриложение.ПометкаУдаления
		|	И МобильноеПриложение.Ссылка <> &ЭтотУзел");
		
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.МобильноеПриложение.ЭтотУзел());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Возвращает имя семейства конфигураций. 
// Используется для поддержки обменов с измененными конфигурациями в сервисе.
//
Функция ИмяКонфигурацииИсточника() Экспорт
	
	Возврат "МедПреды";
	
КонецФункции // ИмяКонфигурацииИсточника()

// Позволяет переопределить настройки плана обмена, заданные по умолчанию.
// Значения настроек по умолчанию см. в ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию
// 
// Параметры:
//	Настройки - Структура - Содержит настройки по умолчанию
//
// Пример:
//	Настройки.ПредупреждатьОНесоответствииВерсийПравилОбмена = Ложь;
Процедура ОпределитьНастройки(Настройки) Экспорт
	
	
	
КонецПроцедуры // ОпределитьНастройки()

#КонецЕсли