&НаСервере
Процедура СформироватьQR()
	
	АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
	QRСтрока = "sbmcs" + ";" + АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства + ";" + Пользователь; 
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
	QRКод = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьQRКоды()
	
	АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	QRСтрока = "https://play.google.com/store/apps/details?id=com.profit60.mobilemedagents"; 
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
	QRКодAndroid = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
	АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
	QRСтрока = "https://itunes.apple.com/us/app/%D0%BF%D1%80%D0%BE%D1%84-%D0%B8%D1%82-%D0%BC%D0%B5%D0%B4-%D0%BF%D1%80%D0%B5%D0%B4%D1%81%D1%82%D0%B0%D0%B2%D0%B8%D1%82%D0%B5%D0%BB%D0%B8/id1286598151?mt=8";
	ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
	QRКодiOS = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДляПодключенияКЦентральнойБазеСМобильногоУстройства = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
	
	Элементы.ДекорацияШаг2Заголовок.Заголовок = НСТр("ru='После загрузки мобильного приложения используйте этот QR-код для установки соединения'");
	Элементы.ДекорацияСсылка.Видимость = Ложь;
	Элементы.QRКод.Видимость = Истина;
		
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ТекПользователь = Пользователи.ТекущийПользователь();
		Если ТекПользователь.Наименование= "<Не указан>" Тогда
			Пользователь = "";
		Иначе
			Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	//Сценарий = "Директор";
	СформироватьQR();
	СформироватьQRКоды();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияQRAndroidНажатие(Элемент)
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.profit60.mobilemedagents";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКнопкаAndroidНажатие(Элемент)
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.profit60.mobilemedagents";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияQRiOSНажатие(Элемент)
	
	ПерейтиПоНавигационнойСсылке("https://itunes.apple.com/us/app/%D0%BF%D1%80%D0%BE%D1%84-%D0%B8%D1%82-%D0%BC%D0%B5%D0%B4-%D0%BF%D1%80%D0%B5%D0%B4%D1%81%D1%82%D0%B0%D0%B2%D0%B8%D1%82%D0%B5%D0%BB%D0%B8/id1286598151?mt=8");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКнопкаiOSНажатие(Элемент)
	
	АдресСтраницы = "https://itunes.apple.com/us/app/%D0%BF%D1%80%D0%BE%D1%84-%D0%B8%D1%82-%D0%BC%D0%B5%D0%B4-%D0%BF%D1%80%D0%B5%D0%B4%D1%81%D1%82%D0%B0%D0%B2%D0%B8%D1%82%D0%B5%D0%BB%D0%B8/id1286598151?mt=8";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНажатие(Элемент)
	
	АдресСтраницы = "http://www.prof-it.ru/ma/nastroyka-mekhanizma-sinkhronizatsii/";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Оповестить("НастройкаМобильногоПриложенияГотово");
	
КонецПроцедуры

