
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЕстьПланыОбмена() Тогда
		ОткрытьФорму("ПланОбмена.МобильноеПриложение.Форма.ФормаСписка",
			,
			,
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Окно
		);
	Иначе
		ОткрытьФорму("ПланОбмена.МобильноеПриложение.Форма.ФормаПодключения",
			,
			,
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Окно
		);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьПланыОбмена()
	
	Если РольДоступна("ПолныеПрава") Тогда
		ВыборкаПлановОбмена = ПланыОбмена.МобильноеПриложение.Выбрать();
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МобильноеПриложение.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДоступныеПроекты.Супервайзер КАК Ссылка
		|		ИЗ
		|			РегистрСведений.ДоступныеПроекты КАК ДоступныеПроекты
		|		ГДЕ
		|			ДоступныеПроекты.Супервайзер = &Супервайзер
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ДоступныеПроекты.МедПредставитель
		|		ИЗ
		|			РегистрСведений.ДоступныеПроекты КАК ДоступныеПроекты
		|		ГДЕ
		|			ДоступныеПроекты.Супервайзер = &Супервайзер) КАК ВложенныйЗапрос
		|		ПО МобильноеПриложение.Пользователь = ВложенныйЗапрос.Ссылка"
		;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Супервайзер", Пользователи.ТекущийПользователь());
		
		ВыборкаПлановОбмена = Запрос.Выполнить().Выбрать();
	КонецЕсли;
	
	ВыборкаПлановОбмена.Следующий();
	Если ВыборкаПлановОбмена.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции
