#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И Не ЭтоГруппа Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("НомерТелефона") Тогда
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(
				ЭтотОбъект,
				УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(ДанныеЗаполнения.НомерТелефона, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента),
				Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента,
				Перечисления.ТипыКонтактнойИнформации.Телефон
			);
		КонецЕсли;
		
	КонецЕсли;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	//Если Не Справочники.ГруппыДоступаКонтрагентов.ИспользуютсяГруппыДоступа() Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("ГруппаДоступа");
	//КонецЕсли;
	
	//Если Не ВидКонтрагента = Перечисления.ВидыКонтрагентов.ГосударственныйОрган Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("ВидГосударственногоОргана");
	//	МассивНепроверяемыхРеквизитов.Добавить("КодГосударственногоОргана");
	//КонецЕсли;
	//
	//ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// 1. Действия, выполняемые всегда, в том числе и при обмене данными
	
	ДополнительныеСвойства.Вставить("НужноЗаписыватьВРегистрПриЗаписи", Ложь);
	
	// Не выполнять дальнейшие действия при обмене данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// 2. Дальнейшие действия не выполняются в случае, когда запись инициирована механизмом обмена данными
	
	// Проверим согласованность внесенных изменений с другими объектами базы
	Если Не ЭтоНовый() Тогда
		ПроверитьВозможностьИзменений(Отказ);
	КонецЕсли;
	
	// Не выполнять дальнейшие действия при отказе в записи
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// 3. Дальнейшие действия не выполняются при отказе в записи объекта
	
	// Проверим корректность ИНН, КПП и зарегистрируем дубли контрагентов,
	// кроме случая загрузки/выгрузки из локальной версии в модель сервиса.
	Если Не (ДополнительныеСвойства.Свойство("РегистрироватьДублиКонтрагентов") И ДополнительныеСвойства.РегистрироватьДублиКонтрагентов = Ложь) Тогда
		ЗарегистрироватьДублиКонтрагентов();
	КонецЕсли;
	
	// Дозаполним реквизиты
	Если Не ЭтоГруппа И ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЭтоГруппа Тогда
		СформироватьОсновныеСведения();
	КонецЕсли;
		
	// Настройка данных реквизитов в зависимости от других реквизитов
	ПривестиДанныеКСогласованномуСостоянию();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.НужноЗаписыватьВРегистрПриЗаписи Тогда
		Справочники.Контрагенты.ВыполнитьДвиженияПоРегиструДублей(Ссылка, ИНН, КПП, Ложь);
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда
		КонтактноеЛицо				= Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьРегистрациюДублейПередУдалением();
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура заполняет вспомогательный реквизит "ОсновныеСведения"
//
Процедура СформироватьОсновныеСведения() Экспорт
	
	МассивСтрок = Новый Массив;
	
	Если Не ПустаяСтрока(НаименованиеПолное) Тогда
		МассивСтрок.Добавить(НаименованиеПолное);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИНН) Тогда
		МассивСтрок.Добавить(НСтр("ru='ИНН'") + " " + ИНН);
	КонецЕсли;
	
	Если Не ПустаяСтрока(КПП) Тогда
		МассивСтрок.Добавить(НСтр("ru='КПП'") + " " + КПП);
	КонецЕсли;
			
	КИ = КонтактнаяИнформация.Выгрузить();
	КИ.Сортировать("Вид");
	Для Каждого СтрокаКИ Из КИ Цикл
		Если ПустаяСтрока(СтрокаКИ.Представление) Тогда
			Продолжить;
		КонецЕсли;
		МассивСтрок.Добавить(СтрокаКИ.Представление);
	КонецЦикла;
	
	Если ДополнительныеСвойства.Свойство("ОсновныеСведенияКонтактныхЛиц") Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСтрок, ДополнительныеСвойства.ОсновныеСведенияКонтактныхЛиц);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактныеЛица.Наименование КАК Наименование,
			|	КонтактныеЛица.КонтактнаяИнформация.(
			|		Представление КАК Представление,
			|		Вид КАК ВидКИ
			|	)
			|ИЗ
			|	Справочник.КонтактныеЛица КАК КонтактныеЛица
			|ГДЕ
			|	КонтактныеЛица.Владелец = &Контрагент
			|	И КонтактныеЛица.ПометкаУдаления = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Наименование,
			|	ВидКИ";
		
		Запрос.УстановитьПараметр("Контрагент", Ссылка);
		
		ВыборкаКЛ = Запрос.Выполнить().Выбрать();
		Пока ВыборкаКЛ.Следующий() Цикл
			
			Если МассивСтрок.Количество() > 0 Тогда
				МассивСтрок.Добавить(Символы.ПС);
			КонецЕсли;
			МассивСтрок.Добавить(ВыборкаКЛ.Наименование);
			
			ВыборкаКИ = ВыборкаКЛ.КонтактнаяИнформация.Выбрать();
			Пока ВыборкаКИ.Следующий() Цикл
				Если ПустаяСтрока(ВыборкаКИ.Представление) Тогда
					Продолжить;
				КонецЕсли;
				МассивСтрок.Добавить(ВыборкаКИ.Представление);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(Комментарий) Тогда
		МассивСтрок.Добавить(Комментарий);
	КонецЕсли;
		
	ОсновныеСведения = СтрСоединить(МассивСтрок, Символы.ПС);
	
КонецПроцедуры

// Процедура заполняет вспомогательный реквизит "НомерТелефона"
//
Процедура ЗаполнитьНомерТелефона() Экспорт
	
	НомераТелефонов = Новый Массив;
	
	Для Каждого СтрокаКИ Из КонтактнаяИнформация Цикл
		Если СтрокаКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			НомераТелефонов.Добавить(СтрокаКИ.Представление);
		КонецЕсли;
	КонецЦикла;
	
	НомерТелефона = СтрСоединить(НомераТелефонов, ", ");
	
КонецПроцедуры

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения, Изменение: объект разрешен по виду доступа ГруппыДоступаКонтрагентов.
	
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Ссылка;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДозаполнитьПоУмолчанию()
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
			
КонецПроцедуры

// Процедура проверяет корректность ИНН, КПП и фиксирует наличие дублей контрагента
//
Процедура ЗарегистрироватьДублиКонтрагентов()
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	НужноВыполнятьПроверку = ЭтоНовый();
	
	ЭтоЮрЛицо = ТипКонтрагента = Перечисления.ТипыКонтрагентов.ЮридическоеЛицо;
	
	ИзменилсяИНН = НужноВыполнятьПроверку;
	ИзменилсяКПП = НужноВыполнятьПроверку;
	
	Если НЕ НужноВыполнятьПроверку Тогда
		
		СтруктураПрежнихЗначений = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
																			  "ИНН,
																			  |КПП,
																			  |ТипКонтрагента");
																			  
		Если НЕ СтруктураПрежнихЗначений.ИНН = ИНН 
			Или НЕ СтруктураПрежнихЗначений.КПП = КПП 
			Или НЕ СтруктураПрежнихЗначений.ТипКонтрагента = ТипКонтрагента Тогда
			
			НужноВыполнятьПроверку = Истина;
			
		КонецЕсли;
		
		ИзменилсяИНН = НЕ СтруктураПрежнихЗначений.ИНН = ИНН;
		ИзменилсяКПП = НЕ СтруктураПрежнихЗначений.КПП = КПП;
		
		ЭтоЮрЛицоБыло = СтруктураПрежнихЗначений.ТипКонтрагента = Перечисления.ТипыКонтрагентов.ЮридическоеЛицо;
		
		Если НужноВыполнятьПроверку Тогда
			
			Если НЕ СтруктураПрежнихЗначений.ИНН = ИНН
				Или НЕ СтруктураПрежнихЗначений.КПП = КПП Тогда
			
				Блокировка = Новый БлокировкаДанных;
				
				Если НЕ СтруктураПрежнихЗначений.ИНН = ИНН Тогда
			
					ЭлементБлокировкиПоПрежнемуИНН = Блокировка.Добавить("РегистрСведений.НаличиеДублейУКонтрагентов");
					ЭлементБлокировкиПоПрежнемуИНН.УстановитьЗначение("ИНН", СтруктураПрежнихЗначений.ИНН);
					ЭлементБлокировкиПоПрежнемуИНН.Режим = РежимБлокировкиДанных.Исключительный;
					
				КонецЕсли;
				
				Если НЕ СтруктураПрежнихЗначений.КПП = КПП И ЭтоЮрЛицоБыло Тогда
			
					ЭлементБлокировкиПоПрежнемуКПП = Блокировка.Добавить("РегистрСведений.НаличиеДублейУКонтрагентов");
					ЭлементБлокировкиПоПрежнемуКПП.УстановитьЗначение("КПП", СтруктураПрежнихЗначений.КПП);
					ЭлементБлокировкиПоПрежнемуКПП.Режим = РежимБлокировкиДанных.Исключительный;
					
				КонецЕсли;
			
				Блокировка.Заблокировать();
				
			КонецЕсли;
			
			ПрежнийМассивДублей = Справочники.Контрагенты.ЕстьЗаписиВРегистреДублей(СокрЛП(СтруктураПрежнихЗначений.ИНН), 
																								  СокрЛП(СтруктураПрежнихЗначений.КПП), 
																								  Ссылка);
		Иначе
			ПрежнийМассивДублей = Новый Массив;
		КонецЕсли;
		
	Иначе
		
		ПрежнийМассивДублей = Новый Массив;
		
	КонецЕсли;
	
	Если НужноВыполнятьПроверку Тогда
		
		ОписаниеОшибки = "";
		Если ПустаяСтрока(ИНН) Тогда
			ИННВведенКорректно = Истина;
		Иначе
			ИННВведенКорректно = РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, ЭтоЮрЛицо, ОписаниеОшибки);
		КонецЕсли;
		
		Если ПустаяСтрока(КПП) Тогда
			КППВведенКорректно = Истина;
		Иначе
			КППВведенКорректно = РегламентированныеДанныеКлиентСервер.КППСоответствуетТребованиям(КПП, ОписаниеОшибки);
		КонецЕсли;
		
		Если (ИзменилсяИНН Или ИзменилсяКПП)
			И (ИННВведенКорректно И Не ПустаяСтрока(ИНН))
			И (Не ЭтоЮрЛицо Или (КППВведенКорректно И Не ПустаяСтрока(КПП))) Тогда
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировкиПоИНН = Блокировка.Добавить("РегистрСведений.НаличиеДублейУКонтрагентов");
			ЭлементБлокировкиПоИНН.УстановитьЗначение("ИНН", ИНН);
			ЭлементБлокировкиПоИНН.Режим = РежимБлокировкиДанных.Исключительный;
			
			Если ЭтоЮрЛицо Тогда
				
				ЭлементБлокировкиПоКПП = Блокировка.Добавить("РегистрСведений.НаличиеДублейУКонтрагентов");
				ЭлементБлокировкиПоКПП.УстановитьЗначение("КПП", КПП);
				ЭлементБлокировкиПоКПП.Режим = РежимБлокировкиДанных.Исключительный;
				
			КонецЕсли;
			
			Блокировка.Заблокировать();
			
			МассивДублей = Справочники.Контрагенты.ПроверитьДублиСправочникаКонтрагентыПоИННКПП(СокрЛП(ИНН), 
																								СокрЛП(КПП), 
																								Ссылка, Истина);
																								
			Если МассивДублей.Количество() > 0 Тогда
				
				// Для нового элемента Ссылка будет доступна только ПриЗаписи, там и запишем.
				ДополнительныеСвойства.НужноЗаписыватьВРегистрПриЗаписи = Истина;
				
				Для Каждого ЭлементМассива Из МассивДублей Цикл
					Справочники.Контрагенты.ВыполнитьДвиженияПоРегиструДублей(ЭлементМассива, ИНН, КПП, Ложь);
				КонецЦикла;
				
			КонецЕсли;
			
			Если ПрежнийМассивДублей.Количество() > 0 Тогда
				
				Справочники.Контрагенты.ВыполнитьДвиженияПоРегиструДублей(Ссылка, СтруктураПрежнихЗначений.ИНН, СтруктураПрежнихЗначений.КПП, Истина);
				
				Если ПрежнийМассивДублей.Количество() = 1 Тогда
					Справочники.Контрагенты.ВыполнитьДвиженияПоРегиструДублей(ПрежнийМассивДублей[0], СтруктураПрежнихЗначений.ИНН, СтруктураПрежнихЗначений.КПП, Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ПрежнийМассивДублей.Количество() > 0 Тогда
				
				Справочники.Контрагенты.ВыполнитьДвиженияПоРегиструДублей(Ссылка, СтруктураПрежнихЗначений.ИНН, СтруктураПрежнихЗначений.КПП, Истина);
			
				Если ПрежнийМассивДублей.Количество() = 1 Тогда
					Справочники.Контрагенты.ВыполнитьДвиженияПоРегиструДублей(ПрежнийМассивДублей[0], СтруктураПрежнихЗначений.ИНН, СтруктураПрежнихЗначений.КПП, Истина);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура очищает регистр НаличиеДублейУКонтрагентов
//
Процедура УдалитьРегистрациюДублейПередУдалением()
	
	МассивДублей = Справочники.Контрагенты.ЕстьЗаписиВРегистреДублей(СокрЛП(ИНН), СокрЛП(КПП), Ссылка);
	
	Если МассивДублей.Количество() = 1 Тогда
		
		ЭтоЮрЛицо = (ТипКонтрагента = Перечисления.ТипыКонтрагентов.ЮридическоеЛицо) Или (ТипКонтрагента = Перечисления.ТипыКонтрагентов.ГосударственныйОрган);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировкиПоПрежнемуИНН = Блокировка.Добавить("РегистрСведений.НаличиеДублейУКонтрагентов");
		ЭлементБлокировкиПоПрежнемуИНН.УстановитьЗначение("ИНН", ИНН);
		ЭлементБлокировкиПоПрежнемуИНН.Режим = РежимБлокировкиДанных.Исключительный;
		
		Если ЭтоЮрЛицо Тогда
			
			ЭлементБлокировкиПоПрежнемуКПП = Блокировка.Добавить("РегистрСведений.НаличиеДублейУКонтрагентов");
			ЭлементБлокировкиПоПрежнемуКПП.УстановитьЗначение("КПП", КПП);
			ЭлементБлокировкиПоПрежнемуКПП.Режим = РежимБлокировкиДанных.Исключительный;
			
		КонецЕсли;
		
		Блокировка.Заблокировать();
		
		Справочники.Контрагенты.ВыполнитьДвиженияПоРегиструДублей(МассивДублей[0], ИНН, КПП, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет согласованность данных в ИБ с измененным состоянием контрагента
//
// Параметры:
//  Отказ	 - 	Булево - Устанавливается Истина в случае несогласованных данных
//
Процедура ПроверитьВозможностьИзменений(Отказ)
	
	// Запрет изменения аналитики учета взаиморасчетов по контрагенту при наличии движений по регистрам взаиморасчетов.
		
КонецПроцедуры

// Процедура согласовывает состояние одних реквизитов объекта в зависимости от других
//
Процедура ПривестиДанныеКСогласованномуСостоянию()
	
	Если ТипКонтрагента = Перечисления.ТипыКонтрагентов.ЮридическоеЛицо Тогда
		
		ФИО = "";
		ИНН = Лев(ИНН, 10); // ИНН 10 цифр
		Пол = Неопределено;
		ДатаРождения = '00010101';
				
	ИначеЕсли ТипКонтрагента = Перечисления.ТипыКонтрагентов.ИндивидуальныйПредприниматель Тогда
		
		КПП = "";
		
	ИначеЕсли ТипКонтрагента = Перечисления.ТипыКонтрагентов.ФизическоеЛицо Тогда
		
		КПП = "";
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли