#Область ПрограммныйИнтерфейс

// Возвращает цену продажи.
//
// Возвращаемое значение:
//  Число
//
Функция ПолучитьЦенуПродажи() Экспорт
	
	Возврат РегистрыСведений.ЦеныТоваров.ПолучитьЦенуТовара(Ссылка);
	
КонецФункции // ПолучитьЦенуПродажи()

// Возвращает цену поставщиков.
//
// Возвращаемое значение:
//  Число
//
Функция ПолучитьЦенуПоставщиков() Экспорт
	
	Возврат РегистрыСведений.ЦеныПоставщиков.ПолучитьЦенуТовара(, Ссылка);
	
КонецФункции // ПолучитьЦенуПоставщиков()

// Возвращает остаток товара.
//
// Возвращаемое значение:
//  Число
//
Функция ПолучитьОстатокТовара() Экспорт
	
	Возврат РегистрыНакопления.ОстаткиТоваров.ПолучитьКоличествоОстаткаТовара(Ссылка);
	
КонецФункции // ПолучитьОстатокТовара()

Процедура ПриКопировании(ОбъектКопирования)
	
	ТекущийОстаток = 0;
	
КонецПроцедуры

#КонецОбласти
