
Функция ПолучитьКоличествоВизитовВСостоянии(СостояниеЗаказа) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Визит.Ссылка) КАК КоличествоЗаказов
	|ИЗ
	|	Документ.Визит КАК Визит
	|ГДЕ
	|	Визит.СостояниеВизита = &СостояниеВизита
	|	И НЕ Визит.ПометкаУдаления
	|	И Визит.Проведен";
	
	Запрос.УстановитьПараметр("СостояниеВизита", СостояниеЗаказа);
	
	ВыборкаЗаказов = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ВыборкаЗаказов.Следующий() Тогда
		Возврат ВыборкаЗаказов.КоличествоЗаказов;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов